app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @post = Post.new
    @main_user = User.find(current_user.id)
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("author_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", "3"], ["content", "creating another to destroy"], ["created_at", "2019-11-12 01:07:37.193058"], ["updated_at", "2019-11-12 01:07:37.193058"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "this is nyagas post, just trying to edit this post and see what it would give me"], ["updated_at", "2019-11-12 00:27:43.237450"], ["id", 3]]

  def destroy
    @post = Post.find(params[:id])
    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]

  def check_user_for_edit_post
    @user = Post.find(params[:id]).author
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def check_user_for_delete_post
    @user = Post.find(params[:id]).author
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]